#+TITLE: Types of Iterators in C++
#+AUTHOR: Guowei Lv
#+OPTIONS: texht:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LaTeX_HEADER: \usemintedstyle{colorful}
#+LATEX_HEADER_EXTRA:

** Compile and Build

#+BEGIN_SRC emacs-lisp :exports none
;; tangle the source code
(org-babel-tangle)
;; export to pdf
(org-latex-export-to-pdf)
;; build
(shell-command-to-string "make")
#+END_SRC

#+RESULTS:
#+begin_example
#
# Iterator classes in c++
#
# 1. input iterator
# 2. output iterator(no file)
# 3. forward iterator
# 4. bidirectional_iterator
# 5. random access iterator
# 6. const iterator
#
g++ -std=c++11 input_iterator.cpp -o input.o
g++ -std=c++11 forward_iterator.cpp -o forward.o
g++ -std=c++11 random_access_iterator.cpp -o random.o
g++ -std=c++11 const_iterator.cpp -o const.o
g++ -std=c++11 bidirectional_iterator.cpp -o bidirectional.o
#+end_example

** Run

#+begin_src emacs-lisp :exports none
(shell-command-to-string "./input.o")
#+end_src

#+RESULTS:
: sum of the data is 55

#+begin_src emacs-lisp :exports none
(shell-command-to-string "./forward.o")
#+end_src

#+RESULTS:
: Elements: 1 2 3 4 
: Square: 1 4 9 16 
: 1 4 9 16 

#+begin_src emacs-lisp :exports none
(shell-command-to-string "./bidirectional.o")
#+end_src

#+RESULTS:
: Never odd or even1
: reviver1
: telmet0

#+begin_src emacs-lisp :exports none
(shell-command-to-string "./random.o")
#+end_src

#+RESULTS:
: 3 6 7 5 3 5 6 2 9 1 2 7 0 9 3 6 0 6 2 6 

#+begin_src emacs-lisp :exports none
(shell-command-to-string "./forward.o")
#+end_src

#+RESULTS:
: Elements: 1 2 3 4 
: Square: 1 4 9 16 
: 1 4 9 16 

#+begin_src emacs-lisp :exports none
(shell-command-to-string "./const.o")
#+end_src

#+RESULTS:

** Clean
#+begin_src emacs-lisp :exports none
(shell-command-to-string "make clean")
#+end_src

#+RESULTS:
: rm -rf *.cpp *.o *.tex data makefile minted-iterators

